Autodesk.Revit.DB.ConnectorElement.ChangeHostReference(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Changes the connector host reference to a new planar face and a new edge loop.
Remarks:
The connector referenced by an edge loop has the fixed origin as defined by the edge loop.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the new connector location on the planar face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The face is not a planar face.
-or-
The edge is not on the planar face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.ConnectorElement.ChangeHostReference(Autodesk.Revit.DB.Reference)
Changes the connector host reference to a new planar face.
Remarks:
The connector referenced by a planar face alone is placed at the plane origin, and may be moved later along the planar face.
planarFace:
The planar face to place the connector on.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The face is not a planar face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.ConnectorElement.CreateCableTrayConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new cable tray ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The cable tray ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateConduitConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new conduit ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The conduit ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateElectricalConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.ElectricalSystemType,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new electrical ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
electricalSystemType:
The ElectricalSystemTYpe of the connector.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The electrical ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateCableTrayConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Create a new cable tray ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
Returns:
The cable tray ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreateConduitConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Create a new conduit ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
Returns:
The conduit ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreateElectricalConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.ElectricalSystemType,Autodesk.Revit.DB.Reference)
Create a new electrical ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
electricalSystemType:
The ElectricalSystemTYpe of the connector.
planarFace:
The planar face to place the connector on.
Returns:
The electrical ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreateDuctConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Mechanical.DuctSystemType,Autodesk.Revit.DB.ConnectorProfileType,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new duct ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
ductSystemType:
The DuctSystemType of the connector.
profileShape:
The profile shape of the duct.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The duct ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateDuctConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Mechanical.DuctSystemType,Autodesk.Revit.DB.ConnectorProfileType,Autodesk.Revit.DB.Reference)
Create a new duct ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
ductSystemType:
The DuctSystemType of the connector.
profileShape:
The profile shape of the duct.
planarFace:
The planar face to place the connector on.
Returns:
The duct ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreatePipeConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Plumbing.PipeSystemType,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new pipe ConnectorElement with a face and an edge.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
pipeSystemType:
The PipeSystemType of the connector.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The pipe ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreatePipeConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Plumbing.PipeSystemType,Autodesk.Revit.DB.Reference)
Create a new pipe ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
pipeSystemType:
The PipeSystemType of the connector.
planarFace:
The planar face to place the connector on.
Returns:
The pipe ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013